hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpdma.h
// MISR Configuration

#define	GPDMA_MISR_MIS15				(0x1u<<15)
#define	GPDMA_MISR_MIS14				(0x1u<<14)
#define	GPDMA_MISR_MIS13				(0x1u<<13)
#define	GPDMA_MISR_MIS12				(0x1u<<12)
#define	GPDMA_MISR_MIS11				(0x1u<<11)
#define	GPDMA_MISR_MIS10				(0x1u<<10)
#define	GPDMA_MISR_MIS9					(0x1u<<9)
#define	GPDMA_MISR_MIS8					(0x1u<<8)
#define	GPDMA_MISR_MIS7					(0x1u<<7)
#define	GPDMA_MISR_MIS6					(0x1u<<6)
#define	GPDMA_MISR_MIS5					(0x1u<<5)
#define	GPDMA_MISR_MIS4					(0x1u<<4)
#define	GPDMA_MISR_MIS3					(0x1u<<3)
#define	GPDMA_MISR_MIS2					(0x1u<<2)
#define	GPDMA_MISR_MIS1					(0x1u<<1)
#define	GPDMA_MISR_MIS0					(0x1u<<0)

#define	GPDMA_MISR_MIS15_B_0X0			(0x0u<<15)
#define	GPDMA_MISR_MIS15_B_0X1			(0x1u<<15)
#define	GPDMA_MISR_MIS14_B_0X0			(0x0u<<14)
#define	GPDMA_MISR_MIS14_B_0X1			(0x1u<<14)
#define	GPDMA_MISR_MIS13_B_0X0			(0x0u<<13)
#define	GPDMA_MISR_MIS13_B_0X1			(0x1u<<13)
#define	GPDMA_MISR_MIS12_B_0X0			(0x0u<<12)
#define	GPDMA_MISR_MIS12_B_0X1			(0x1u<<12)
#define	GPDMA_MISR_MIS11_B_0X0			(0x0u<<11)
#define	GPDMA_MISR_MIS11_B_0X1			(0x1u<<11)
#define	GPDMA_MISR_MIS10_B_0X0			(0x0u<<10)
#define	GPDMA_MISR_MIS10_B_0X1			(0x1u<<10)
#define	GPDMA_MISR_MIS9_B_0X0			(0x0u<<9)
#define	GPDMA_MISR_MIS9_B_0X1			(0x1u<<9)
#define	GPDMA_MISR_MIS8_B_0X0			(0x0u<<8)
#define	GPDMA_MISR_MIS8_B_0X1			(0x1u<<8)
#define	GPDMA_MISR_MIS7_B_0X0			(0x0u<<7)
#define	GPDMA_MISR_MIS7_B_0X1			(0x1u<<7)
#define	GPDMA_MISR_MIS6_B_0X0			(0x0u<<6)
#define	GPDMA_MISR_MIS6_B_0X1			(0x1u<<6)
#define	GPDMA_MISR_MIS5_B_0X0			(0x0u<<5)
#define	GPDMA_MISR_MIS5_B_0X1			(0x1u<<5)
#define	GPDMA_MISR_MIS4_B_0X0			(0x0u<<4)
#define	GPDMA_MISR_MIS4_B_0X1			(0x1u<<4)
#define	GPDMA_MISR_MIS3_B_0X0			(0x0u<<3)
#define	GPDMA_MISR_MIS3_B_0X1			(0x1u<<3)
#define	GPDMA_MISR_MIS2_B_0X0			(0x0u<<2)
#define	GPDMA_MISR_MIS2_B_0X1			(0x1u<<2)
#define	GPDMA_MISR_MIS1_B_0X0			(0x0u<<1)
#define	GPDMA_MISR_MIS1_B_0X1			(0x1u<<1)
#define	GPDMA_MISR_MIS0_B_0X0			(0x0u<<0)
#define	GPDMA_MISR_MIS0_B_0X1			(0x1u<<0)

// SMISR Configuration

#define	GPDMA_SMISR_MIS15				(0x1u<<15)
#define	GPDMA_SMISR_MIS14				(0x1u<<14)
#define	GPDMA_SMISR_MIS13				(0x1u<<13)
#define	GPDMA_SMISR_MIS12				(0x1u<<12)
#define	GPDMA_SMISR_MIS11				(0x1u<<11)
#define	GPDMA_SMISR_MIS10				(0x1u<<10)
#define	GPDMA_SMISR_MIS9				(0x1u<<9)
#define	GPDMA_SMISR_MIS8				(0x1u<<8)
#define	GPDMA_SMISR_MIS7				(0x1u<<7)
#define	GPDMA_SMISR_MIS6				(0x1u<<6)
#define	GPDMA_SMISR_MIS5				(0x1u<<5)
#define	GPDMA_SMISR_MIS4				(0x1u<<4)
#define	GPDMA_SMISR_MIS3				(0x1u<<3)
#define	GPDMA_SMISR_MIS2				(0x1u<<2)
#define	GPDMA_SMISR_MIS1				(0x1u<<1)
#define	GPDMA_SMISR_MIS0				(0x1u<<0)

#define	GPDMA_SMISR_MIS15_B_0X0			(0x0u<<15)
#define	GPDMA_SMISR_MIS15_B_0X1			(0x1u<<15)
#define	GPDMA_SMISR_MIS14_B_0X0			(0x0u<<14)
#define	GPDMA_SMISR_MIS14_B_0X1			(0x1u<<14)
#define	GPDMA_SMISR_MIS13_B_0X0			(0x0u<<13)
#define	GPDMA_SMISR_MIS13_B_0X1			(0x1u<<13)
#define	GPDMA_SMISR_MIS12_B_0X0			(0x0u<<12)
#define	GPDMA_SMISR_MIS12_B_0X1			(0x1u<<12)
#define	GPDMA_SMISR_MIS11_B_0X0			(0x0u<<11)
#define	GPDMA_SMISR_MIS11_B_0X1			(0x1u<<11)
#define	GPDMA_SMISR_MIS10_B_0X0			(0x0u<<10)
#define	GPDMA_SMISR_MIS10_B_0X1			(0x1u<<10)
#define	GPDMA_SMISR_MIS9_B_0X0			(0x0u<<9)
#define	GPDMA_SMISR_MIS9_B_0X1			(0x1u<<9)
#define	GPDMA_SMISR_MIS8_B_0X0			(0x0u<<8)
#define	GPDMA_SMISR_MIS8_B_0X1			(0x1u<<8)
#define	GPDMA_SMISR_MIS7_B_0X0			(0x0u<<7)
#define	GPDMA_SMISR_MIS7_B_0X1			(0x1u<<7)
#define	GPDMA_SMISR_MIS6_B_0X0			(0x0u<<6)
#define	GPDMA_SMISR_MIS6_B_0X1			(0x1u<<6)
#define	GPDMA_SMISR_MIS5_B_0X0			(0x0u<<5)
#define	GPDMA_SMISR_MIS5_B_0X1			(0x1u<<5)
#define	GPDMA_SMISR_MIS4_B_0X0			(0x0u<<4)
#define	GPDMA_SMISR_MIS4_B_0X1			(0x1u<<4)
#define	GPDMA_SMISR_MIS3_B_0X0			(0x0u<<3)
#define	GPDMA_SMISR_MIS3_B_0X1			(0x1u<<3)
#define	GPDMA_SMISR_MIS2_B_0X0			(0x0u<<2)
#define	GPDMA_SMISR_MIS2_B_0X1			(0x1u<<2)
#define	GPDMA_SMISR_MIS1_B_0X0			(0x0u<<1)
#define	GPDMA_SMISR_MIS1_B_0X1			(0x1u<<1)
#define	GPDMA_SMISR_MIS0_B_0X0			(0x0u<<0)
#define	GPDMA_SMISR_MIS0_B_0X1			(0x1u<<0)

// C0LBAR Configuration

#define	GPDMA_C0LBAR_LBA				(0xFFFFu<<16)
#define	GPDMA_C0LBAR_LBA_0				(0x1u<<16)

// C0FCR Configuration

#define	GPDMA_C0FCR_TOF					(0x1u<<14)
#define	GPDMA_C0FCR_SUSPF				(0x1u<<13)
#define	GPDMA_C0FCR_USEF				(0x1u<<12)
#define	GPDMA_C0FCR_ULEF				(0x1u<<11)
#define	GPDMA_C0FCR_DTEF				(0x1u<<10)
#define	GPDMA_C0FCR_HTF					(0x1u<<9)
#define	GPDMA_C0FCR_TCF					(0x1u<<8)

#define	GPDMA_C0FCR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C0FCR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C0FCR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C0FCR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C0FCR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C0FCR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C0FCR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C0FCR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C0FCR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C0FCR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C0FCR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C0FCR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C0FCR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C0FCR_TCF_B_0X1			(0x1u<<8)

// C0SR Configuration

#define	GPDMA_C0SR_FIFOL				(0xFFu<<16)
#define	GPDMA_C0SR_FIFOL_0				(0x1u<<16)
#define	GPDMA_C0SR_TOF					(0x1u<<14)
#define	GPDMA_C0SR_SUSPF				(0x1u<<13)
#define	GPDMA_C0SR_USEF					(0x1u<<12)
#define	GPDMA_C0SR_ULEF					(0x1u<<11)
#define	GPDMA_C0SR_DTEF					(0x1u<<10)
#define	GPDMA_C0SR_HTF					(0x1u<<9)
#define	GPDMA_C0SR_TCF					(0x1u<<8)
#define	GPDMA_C0SR_IDLEF				(0x1u<<0)

#define	GPDMA_C0SR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C0SR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C0SR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C0SR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C0SR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C0SR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C0SR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C0SR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C0SR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C0SR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C0SR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C0SR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C0SR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C0SR_TCF_B_0X1			(0x1u<<8)
#define	GPDMA_C0SR_IDLEF_B_0X0			(0x0u<<0)
#define	GPDMA_C0SR_IDLEF_B_0X1			(0x1u<<0)

// C0CR Configuration

