hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpdma.h
// C1LBAR Configuration

#define	GPDMA_C1LBAR_LBA				(0xFFFFu<<16)
#define	GPDMA_C1LBAR_LBA_0				(0x1u<<16)

// C1FCR Configuration

#define	GPDMA_C1FCR_TOF					(0x1u<<14)
#define	GPDMA_C1FCR_SUSPF				(0x1u<<13)
#define	GPDMA_C1FCR_USEF				(0x1u<<12)
#define	GPDMA_C1FCR_ULEF				(0x1u<<11)
#define	GPDMA_C1FCR_DTEF				(0x1u<<10)
#define	GPDMA_C1FCR_HTF					(0x1u<<9)
#define	GPDMA_C1FCR_TCF					(0x1u<<8)

#define	GPDMA_C1FCR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C1FCR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C1FCR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C1FCR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C1FCR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C1FCR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C1FCR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C1FCR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C1FCR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C1FCR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C1FCR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C1FCR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C1FCR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C1FCR_TCF_B_0X1			(0x1u<<8)

// C1SR Configuration

#define	GPDMA_C1SR_FIFOL				(0xFFu<<16)
#define	GPDMA_C1SR_FIFOL_0				(0x1u<<16)
#define	GPDMA_C1SR_TOF					(0x1u<<14)
#define	GPDMA_C1SR_SUSPF				(0x1u<<13)
#define	GPDMA_C1SR_USEF					(0x1u<<12)
#define	GPDMA_C1SR_ULEF					(0x1u<<11)
#define	GPDMA_C1SR_DTEF					(0x1u<<10)
#define	GPDMA_C1SR_HTF					(0x1u<<9)
#define	GPDMA_C1SR_TCF					(0x1u<<8)
#define	GPDMA_C1SR_IDLEF				(0x1u<<0)

#define	GPDMA_C1SR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C1SR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C1SR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C1SR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C1SR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C1SR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C1SR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C1SR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C1SR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C1SR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C1SR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C1SR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C1SR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C1SR_TCF_B_0X1			(0x1u<<8)
#define	GPDMA_C1SR_IDLEF_B_0X0			(0x0u<<0)
#define	GPDMA_C1SR_IDLEF_B_0X1			(0x1u<<0)

// C1CR Configuration

#define	GPDMA_C1CR_PRIO					(0x3u<<22)
#define	GPDMA_C1CR_PRIO_0				(0x1u<<22)
#define	GPDMA_C1CR_LAP					(0x1u<<17)
#define	GPDMA_C1CR_LSM					(0x1u<<16)
#define	GPDMA_C1CR_TOIE					(0x1u<<14)
#define	GPDMA_C1CR_SUSPIE				(0x1u<<13)
#define	GPDMA_C1CR_USEIE				(0x1u<<12)
#define	GPDMA_C1CR_ULEIE				(0x1u<<11)
#define	GPDMA_C1CR_DTEIE				(0x1u<<10)
#define	GPDMA_C1CR_HTIE					(0x1u<<9)
#define	GPDMA_C1CR_TCIE					(0x1u<<8)
#define	GPDMA_C1CR_SUSP					(0x1u<<2)
#define	GPDMA_C1CR_RESET				(0x1u<<1)
#define	GPDMA_C1CR_EN					(0x1u<<0)

#define	GPDMA_C1CR_PRIO_B_0X0			(0x0u<<22)
#define	GPDMA_C1CR_PRIO_B_0X1			(0x1u<<22)
#define	GPDMA_C1CR_PRIO_B_0X2			(0x2u<<22)
#define	GPDMA_C1CR_PRIO_B_0X3			(0x3u<<22)
#define	GPDMA_C1CR_LAP_B_0X0			(0x0u<<17)
#define	GPDMA_C1CR_LAP_B_0X1			(0x1u<<17)
#define	GPDMA_C1CR_LSM_B_0X0			(0x0u<<16)
#define	GPDMA_C1CR_LSM_B_0X1			(0x1u<<16)
#define	GPDMA_C1CR_TOIE_B_0X0			(0x0u<<14)
#define	GPDMA_C1CR_TOIE_B_0X1			(0x1u<<14)
#define	GPDMA_C1CR_SUSPIE_B_0X0			(0x0u<<13)
#define	GPDMA_C1CR_SUSPIE_B_0X1			(0x1u<<13)
#define	GPDMA_C1CR_USEIE_B_0X0			(0x0u<<12)
#define	GPDMA_C1CR_USEIE_B_0X1			(0x1u<<12)
#define	GPDMA_C1CR_ULEIE_B_0X0			(0x0u<<11)
#define	GPDMA_C1CR_ULEIE_B_0X1			(0x1u<<11)
#define	GPDMA_C1CR_DTEIE_B_0X0			(0x0u<<10)
#define	GPDMA_C1CR_DTEIE_B_0X1			(0x1u<<10)
#define	GPDMA_C1CR_HTIE_B_0X0			(0x0u<<9)
#define	GPDMA_C1CR_HTIE_B_0X1			(0x1u<<9)
#define	GPDMA_C1CR_TCIE_B_0X0			(0x0u<<8)
#define	GPDMA_C1CR_TCIE_B_0X1			(0x1u<<8)
#define	GPDMA_C1CR_SUSP_B_0X0			(0x0u<<2)
#define	GPDMA_C1CR_SUSP_B_0X1			(0x1u<<2)
#define	GPDMA_C1CR_RESET_B_0X0			(0x0u<<1)
#define	GPDMA_C1CR_RESET_B_0X1			(0x1u<<1)
#define	GPDMA_C1CR_EN_B_0X0				(0x0u<<0)
#define	GPDMA_C1CR_EN_B_0X1				(0x1u<<0)

// C1TR1 Configuration

#define	GPDMA_C1TR1_DSEC				(0x1u<<31)
#define	GPDMA_C1TR1_DAP					(0x1u<<30)
#define	GPDMA_C1TR1_DHX					(0x1u<<27)
#define	GPDMA_C1TR1_DBX					(0x1u<<26)
#define	GPDMA_C1TR1_DBL_1				(0x3Fu<<20)
#define	GPDMA_C1TR1_DBL_1_0				(0x1u<<20)
#define	GPDMA_C1TR1_DINC				(0x1u<<19)
#define	GPDMA_C1TR1_DDW_LOG2			(0x3u<<16)
#define	GPDMA_C1TR1_DDW_LOG2_0			(0x1u<<16)
#define	GPDMA_C1TR1_SSEC				(0x1u<<15)
#define	GPDMA_C1TR1_SAP					(0x1u<<14)
#define	GPDMA_C1TR1_SBX					(0x1u<<13)
#define	GPDMA_C1TR1_PAM					(0x3u<<11)
#define	GPDMA_C1TR1_PAM_0				(0x1u<<11)
#define	GPDMA_C1TR1_SBL_1				(0x3Fu<<4)
#define	GPDMA_C1TR1_SBL_1_0				(0x1u<<4)
#define	GPDMA_C1TR1_SINC				(0x1u<<3)
#define	GPDMA_C1TR1_SDW_LOG2			(0x3u<<0)
#define	GPDMA_C1TR1_SDW_LOG2_0			(0x1u<<0)

#define	GPDMA_C1TR1_DSEC_B_0X0			(0x0u<<31)
#define	GPDMA_C1TR1_DSEC_B_0X1			(0x1u<<31)
#define	GPDMA_C1TR1_DAP_B_0X0			(0x0u<<30)
#define	GPDMA_C1TR1_DAP_B_0X1			(0x1u<<30)
#define	GPDMA_C1TR1_DHX_B_0X0			(0x0u<<27)
#define	GPDMA_C1TR1_DHX_B_0X1			(0x1u<<27)
#define	GPDMA_C1TR1_DBX_B_0X0			(0x0u<<26)
#define	GPDMA_C1TR1_DBX_B_0X1			(0x1u<<26)
#define	GPDMA_C1TR1_DINC_B_0X0			(0x0u<<19)
#define	GPDMA_C1TR1_DINC_B_0X1			(0x1u<<19)
#define	GPDMA_C1TR1_DDW_LOG2_B_0X0		(0x0u<<16)
#define	GPDMA_C1TR1_DDW_LOG2_B_0X1		(0x1u<<16)
#define	GPDMA_C1TR1_DDW_LOG2_B_0X2		(0x2u<<16)
#define	GPDMA_C1TR1_DDW_LOG2_B_0X3		(0x3u<<16)
#define	GPDMA_C1TR1_SSEC_B_0X0			(0x0u<<15)
#define	GPDMA_C1TR1_SSEC_B_0X1			(0x1u<<15)
#define	GPDMA_C1TR1_SAP_B_0X0			(0x0u<<14)
#define	GPDMA_C1TR1_SAP_B_0X1			(0x1u<<14)
#define	GPDMA_C1TR1_SBX_B_0X0			(0x0u<<13)
#define	GPDMA_C1TR1_SBX_B_0X1			(0x1u<<13)
#define	GPDMA_C1TR1_PAM_B_0X0_PAM_1		(0x0u<<11)
#define	GPDMA_C1TR1_PAM_B_0X1_PAM_1		(0x1u<<11)
#define	GPDMA_C1TR1_PAM_B_0X2_PAM_1		(0x2u<<11)
#define	GPDMA_C1TR1_PAM_B_0X3_PAM_1		(0x3u<<11)
#define	GPDMA_C1TR1_SINC_B_0X0			(0x0u<<3)
#define	GPDMA_C1TR1_SINC_B_0X1			(0x1u<<3)
#define	GPDMA_C1TR1_SDW_LOG2_B_0X0		(0x0u<<0)
#define	GPDMA_C1TR1_SDW_LOG2_B_0X1		(0x1u<<0)
#define	GPDMA_C1TR1_SDW_LOG2_B_0X2		(0x2u<<0)
#define	GPDMA_C1TR1_SDW_LOG2_B_0X3		(0x3u<<0)

// C1TR2 Configuration

