hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpdma.h
#define	GPDMA_C8BR1_BNDT				(0xFFFFu<<0)
#define	GPDMA_C8BR1_BNDT_0				(0x1u<<0)

// C8SAR Configuration

#define	GPDMA_C8SAR_SA					(0xFFFFFFFFu<<0)
#define	GPDMA_C8SAR_SA_0				(0x1u<<0)

// C8DAR Configuration

#define	GPDMA_C8DAR_DA					(0xFFFFFFFFu<<0)
#define	GPDMA_C8DAR_DA_0				(0x1u<<0)

// C8LLR Configuration

#define	GPDMA_C8LLR_UT1					(0x1u<<31)
#define	GPDMA_C8LLR_UT2					(0x1u<<30)
#define	GPDMA_C8LLR_UB1					(0x1u<<29)
#define	GPDMA_C8LLR_USA					(0x1u<<28)
#define	GPDMA_C8LLR_UDA					(0x1u<<27)
#define	GPDMA_C8LLR_ULL					(0x1u<<16)
#define	GPDMA_C8LLR_LA					(0x3FFFu<<2)
#define	GPDMA_C8LLR_LA_0				(0x1u<<2)

#define	GPDMA_C8LLR_UT1_B_0X0			(0x0u<<31)
#define	GPDMA_C8LLR_UT1_B_0X1			(0x1u<<31)
#define	GPDMA_C8LLR_UT2_B_0X0			(0x0u<<30)
#define	GPDMA_C8LLR_UT2_B_0X1			(0x1u<<30)
#define	GPDMA_C8LLR_UB1_B_0X0			(0x0u<<29)
#define	GPDMA_C8LLR_UB1_B_0X1			(0x1u<<29)
#define	GPDMA_C8LLR_USA_B_0X0			(0x0u<<28)
#define	GPDMA_C8LLR_USA_B_0X1			(0x1u<<28)
#define	GPDMA_C8LLR_UDA_B_0X0			(0x0u<<27)
#define	GPDMA_C8LLR_UDA_B_0X1			(0x1u<<27)
#define	GPDMA_C8LLR_ULL_B_0X0			(0x0u<<16)
#define	GPDMA_C8LLR_ULL_B_0X1			(0x1u<<16)

// C9LBAR Configuration

#define	GPDMA_C9LBAR_LBA				(0xFFFFu<<16)
#define	GPDMA_C9LBAR_LBA_0				(0x1u<<16)

// C9FCR Configuration

#define	GPDMA_C9FCR_TOF					(0x1u<<14)
#define	GPDMA_C9FCR_SUSPF				(0x1u<<13)
#define	GPDMA_C9FCR_USEF				(0x1u<<12)
#define	GPDMA_C9FCR_ULEF				(0x1u<<11)
#define	GPDMA_C9FCR_DTEF				(0x1u<<10)
#define	GPDMA_C9FCR_HTF					(0x1u<<9)
#define	GPDMA_C9FCR_TCF					(0x1u<<8)

#define	GPDMA_C9FCR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C9FCR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C9FCR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C9FCR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C9FCR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C9FCR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C9FCR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C9FCR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C9FCR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C9FCR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C9FCR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C9FCR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C9FCR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C9FCR_TCF_B_0X1			(0x1u<<8)

// C9SR Configuration

#define	GPDMA_C9SR_FIFOL				(0xFFu<<16)
#define	GPDMA_C9SR_FIFOL_0				(0x1u<<16)
#define	GPDMA_C9SR_TOF					(0x1u<<14)
#define	GPDMA_C9SR_SUSPF				(0x1u<<13)
#define	GPDMA_C9SR_USEF					(0x1u<<12)
#define	GPDMA_C9SR_ULEF					(0x1u<<11)
#define	GPDMA_C9SR_DTEF					(0x1u<<10)
#define	GPDMA_C9SR_HTF					(0x1u<<9)
#define	GPDMA_C9SR_TCF					(0x1u<<8)
#define	GPDMA_C9SR_IDLEF				(0x1u<<0)

#define	GPDMA_C9SR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C9SR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C9SR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C9SR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C9SR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C9SR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C9SR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C9SR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C9SR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C9SR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C9SR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C9SR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C9SR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C9SR_TCF_B_0X1			(0x1u<<8)
#define	GPDMA_C9SR_IDLEF_B_0X0			(0x0u<<0)
#define	GPDMA_C9SR_IDLEF_B_0X1			(0x1u<<0)

// C9CR Configuration

#define	GPDMA_C9CR_PRIO					(0x3u<<22)
#define	GPDMA_C9CR_PRIO_0				(0x1u<<22)
#define	GPDMA_C9CR_LAP					(0x1u<<17)
#define	GPDMA_C9CR_LSM					(0x1u<<16)
#define	GPDMA_C9CR_TOIE					(0x1u<<14)
#define	GPDMA_C9CR_SUSPIE				(0x1u<<13)
#define	GPDMA_C9CR_USEIE				(0x1u<<12)
#define	GPDMA_C9CR_ULEIE				(0x1u<<11)
#define	GPDMA_C9CR_DTEIE				(0x1u<<10)
#define	GPDMA_C9CR_HTIE					(0x1u<<9)
#define	GPDMA_C9CR_TCIE					(0x1u<<8)
#define	GPDMA_C9CR_SUSP					(0x1u<<2)
#define	GPDMA_C9CR_RESET				(0x1u<<1)
#define	GPDMA_C9CR_EN					(0x1u<<0)

#define	GPDMA_C9CR_PRIO_B_0X0			(0x0u<<22)
#define	GPDMA_C9CR_PRIO_B_0X1			(0x1u<<22)
#define	GPDMA_C9CR_PRIO_B_0X2			(0x2u<<22)
#define	GPDMA_C9CR_PRIO_B_0X3			(0x3u<<22)
#define	GPDMA_C9CR_LAP_B_0X0			(0x0u<<17)
#define	GPDMA_C9CR_LAP_B_0X1			(0x1u<<17)
#define	GPDMA_C9CR_LSM_B_0X0			(0x0u<<16)
#define	GPDMA_C9CR_LSM_B_0X1			(0x1u<<16)
#define	GPDMA_C9CR_TOIE_B_0X0			(0x0u<<14)
#define	GPDMA_C9CR_TOIE_B_0X1			(0x1u<<14)
#define	GPDMA_C9CR_SUSPIE_B_0X0			(0x0u<<13)
#define	GPDMA_C9CR_SUSPIE_B_0X1			(0x1u<<13)
#define	GPDMA_C9CR_USEIE_B_0X0			(0x0u<<12)
#define	GPDMA_C9CR_USEIE_B_0X1			(0x1u<<12)
#define	GPDMA_C9CR_ULEIE_B_0X0			(0x0u<<11)
#define	GPDMA_C9CR_ULEIE_B_0X1			(0x1u<<11)
#define	GPDMA_C9CR_DTEIE_B_0X0			(0x0u<<10)
#define	GPDMA_C9CR_DTEIE_B_0X1			(0x1u<<10)
#define	GPDMA_C9CR_HTIE_B_0X0			(0x0u<<9)
#define	GPDMA_C9CR_HTIE_B_0X1			(0x1u<<9)
#define	GPDMA_C9CR_TCIE_B_0X0			(0x0u<<8)
#define	GPDMA_C9CR_TCIE_B_0X1			(0x1u<<8)
#define	GPDMA_C9CR_SUSP_B_0X0			(0x0u<<2)
#define	GPDMA_C9CR_SUSP_B_0X1			(0x1u<<2)
#define	GPDMA_C9CR_RESET_B_0X0			(0x0u<<1)
#define	GPDMA_C9CR_RESET_B_0X1			(0x1u<<1)
#define	GPDMA_C9CR_EN_B_0X0				(0x0u<<0)
#define	GPDMA_C9CR_EN_B_0X1				(0x1u<<0)

// C9TR1 Configuration

#define	GPDMA_C9TR1_DSEC				(0x1u<<31)
#define	GPDMA_C9TR1_DAP					(0x1u<<30)
#define	GPDMA_C9TR1_DHX					(0x1u<<27)
#define	GPDMA_C9TR1_DBX					(0x1u<<26)
#define	GPDMA_C9TR1_DBL_1				(0x3Fu<<20)
#define	GPDMA_C9TR1_DBL_1_0				(0x1u<<20)
#define	GPDMA_C9TR1_DINC				(0x1u<<19)
#define	GPDMA_C9TR1_DDW_LOG2			(0x3u<<16)
#define	GPDMA_C9TR1_DDW_LOG2_0			(0x1u<<16)
#define	GPDMA_C9TR1_SSEC				(0x1u<<15)
#define	GPDMA_C9TR1_SAP					(0x1u<<14)
#define	GPDMA_C9TR1_SBX					(0x1u<<13)
#define	GPDMA_C9TR1_PAM					(0x3u<<11)
#define	GPDMA_C9TR1_PAM_0				(0x1u<<11)
#define	GPDMA_C9TR1_SBL_1				(0x3Fu<<4)
#define	GPDMA_C9TR1_SBL_1_0				(0x1u<<4)
#define	GPDMA_C9TR1_SINC				(0x1u<<3)
#define	GPDMA_C9TR1_SDW_LOG2			(0x3u<<0)
#define	GPDMA_C9TR1_SDW_LOG2_0			(0x1u<<0)

#define	GPDMA_C9TR1_DSEC_B_0X0			(0x0u<<31)
#define	GPDMA_C9TR1_DSEC_B_0X1			(0x1u<<31)
#define	GPDMA_C9TR1_DAP_B_0X0			(0x0u<<30)
#define	GPDMA_C9TR1_DAP_B_0X1			(0x1u<<30)
#define	GPDMA_C9TR1_DHX_B_0X0			(0x0u<<27)
#define	GPDMA_C9TR1_DHX_B_0X1			(0x1u<<27)
#define	GPDMA_C9TR1_DBX_B_0X0			(0x0u<<26)
#define	GPDMA_C9TR1_DBX_B_0X1			(0x1u<<26)
#define	GPDMA_C9TR1_DINC_B_0X0			(0x0u<<19)
#define	GPDMA_C9TR1_DINC_B_0X1			(0x1u<<19)
#define	GPDMA_C9TR1_DDW_LOG2_B_0X0		(0x0u<<16)
#define	GPDMA_C9TR1_DDW_LOG2_B_0X1		(0x1u<<16)
#define	GPDMA_C9TR1_DDW_LOG2_B_0X2		(0x2u<<16)
#define	GPDMA_C9TR1_DDW_LOG2_B_0X3		(0x3u<<16)
#define	GPDMA_C9TR1_SSEC_B_0X0			(0x0u<<15)
#define	GPDMA_C9TR1_SSEC_B_0X1			(0x1u<<15)
#define	GPDMA_C9TR1_SAP_B_0X0			(0x0u<<14)
#define	GPDMA_C9TR1_SAP_B_0X1			(0x1u<<14)
#define	GPDMA_C9TR1_SBX_B_0X0			(0x0u<<13)
#define	GPDMA_C9TR1_SBX_B_0X1			(0x1u<<13)
#define	GPDMA_C9TR1_PAM_B_0X0_PAM_1		(0x0u<<11)
#define	GPDMA_C9TR1_PAM_B_0X1_PAM_1		(0x1u<<11)
#define	GPDMA_C9TR1_PAM_B_0X2_PAM_1		(0x2u<<11)
#define	GPDMA_C9TR1_PAM_B_0X3_PAM_1		(0x3u<<11)
#define	GPDMA_C9TR1_SINC_B_0X0			(0x0u<<3)
#define	GPDMA_C9TR1_SINC_B_0X1			(0x1u<<3)
#define	GPDMA_C9TR1_SDW_LOG2_B_0X0		(0x0u<<0)
#define	GPDMA_C9TR1_SDW_LOG2_B_0X1		(0x1u<<0)
#define	GPDMA_C9TR1_SDW_LOG2_B_0X2		(0x2u<<0)
#define	GPDMA_C9TR1_SDW_LOG2_B_0X3		(0x3u<<0)

// C9TR2 Configuration

#define	GPDMA_C9TR2_TCEM				(0x3u<<30)
#define	GPDMA_C9TR2_TCEM_0				(0x1u<<30)
#define	GPDMA_C9TR2_TRIGPOL				(0x3u<<24)
#define	GPDMA_C9TR2_TRIGPOL_0			(0x1u<<24)
#define	GPDMA_C9TR2_TRIGSEL				(0x7Fu<<16)
#define	GPDMA_C9TR2_TRIGSEL_0			(0x1u<<16)
#define	GPDMA_C9TR2_TRIGM				(0x3u<<14)
#define	GPDMA_C9TR2_TRIGM_0				(0x1u<<14)
#define	GPDMA_C9TR2_PFREQ				(0x1u<<12)
#define	GPDMA_C9TR2_BREQ				(0x1u<<11)
#define	GPDMA_C9TR2_DREQ				(0x1u<<10)
#define	GPDMA_C9TR2_SWREQ				(0x1u<<9)
#define	GPDMA_C9TR2_REQSEL				(0xFFu<<0)
#define	GPDMA_C9TR2_REQSEL_0			(0x1u<<0)

#define	GPDMA_C9TR2_TCEM_B_0X0			(0x0u<<30)
#define	GPDMA_C9TR2_TCEM_B_0X1			(0x1u<<30)
#define	GPDMA_C9TR2_TCEM_B_0X2			(0x2u<<30)
#define	GPDMA_C9TR2_TCEM_B_0X3			(0x3u<<30)
#define	GPDMA_C9TR2_TRIGPOL_B_0X0		(0x0u<<24)
#define	GPDMA_C9TR2_TRIGPOL_B_0X1		(0x1u<<24)
#define	GPDMA_C9TR2_TRIGPOL_B_0X2		(0x2u<<24)
#define	GPDMA_C9TR2_TRIGPOL_B_0X3		(0x3u<<24)
#define	GPDMA_C9TR2_TRIGM_B_0X0			(0x0u<<14)
#define	GPDMA_C9TR2_TRIGM_B_0X1			(0x1u<<14)
#define	GPDMA_C9TR2_TRIGM_B_0X2			(0x2u<<14)
#define	GPDMA_C9TR2_TRIGM_B_0X3			(0x3u<<14)
#define	GPDMA_C9TR2_PFREQ_B_0X0			(0x0u<<12)
#define	GPDMA_C9TR2_PFREQ_B_0X1			(0x1u<<12)
#define	GPDMA_C9TR2_BREQ_B_0X0			(0x0u<<11)
#define	GPDMA_C9TR2_BREQ_B_0X1			(0x1u<<11)
#define	GPDMA_C9TR2_DREQ_B_0X0			(0x0u<<10)
#define	GPDMA_C9TR2_DREQ_B_0X1			(0x1u<<10)
#define	GPDMA_C9TR2_SWREQ_B_0X0			(0x0u<<9)
#define	GPDMA_C9TR2_SWREQ_B_0X1			(0x1u<<9)

// C9BR1 Configuration

#define	GPDMA_C9BR1_BNDT				(0xFFFFu<<0)
#define	GPDMA_C9BR1_BNDT_0				(0x1u<<0)

// C9SAR Configuration

#define	GPDMA_C9SAR_SA					(0xFFFFFFFFu<<0)
#define	GPDMA_C9SAR_SA_0				(0x1u<<0)

// C9DAR Configuration

#define	GPDMA_C9DAR_DA					(0xFFFFFFFFu<<0)
#define	GPDMA_C9DAR_DA_0				(0x1u<<0)

// C9LLR Configuration

#define	GPDMA_C9LLR_UT1					(0x1u<<31)
#define	GPDMA_C9LLR_UT2					(0x1u<<30)
#define	GPDMA_C9LLR_UB1					(0x1u<<29)
#define	GPDMA_C9LLR_USA					(0x1u<<28)
#define	GPDMA_C9LLR_UDA					(0x1u<<27)
#define	GPDMA_C9LLR_ULL					(0x1u<<16)
#define	GPDMA_C9LLR_LA					(0x3FFFu<<2)
#define	GPDMA_C9LLR_LA_0				(0x1u<<2)

#define	GPDMA_C9LLR_UT1_B_0X0			(0x0u<<31)
#define	GPDMA_C9LLR_UT1_B_0X1			(0x1u<<31)
#define	GPDMA_C9LLR_UT2_B_0X0			(0x0u<<30)
#define	GPDMA_C9LLR_UT2_B_0X1			(0x1u<<30)
#define	GPDMA_C9LLR_UB1_B_0X0			(0x0u<<29)
#define	GPDMA_C9LLR_UB1_B_0X1			(0x1u<<29)
#define	GPDMA_C9LLR_USA_B_0X0			(0x0u<<28)
#define	GPDMA_C9LLR_USA_B_0X1			(0x1u<<28)
#define	GPDMA_C9LLR_UDA_B_0X0			(0x0u<<27)
#define	GPDMA_C9LLR_UDA_B_0X1			(0x1u<<27)
#define	GPDMA_C9LLR_ULL_B_0X0			(0x0u<<16)
#define	GPDMA_C9LLR_ULL_B_0X1			(0x1u<<16)

// C10LBAR Configuration

#define	GPDMA_C10LBAR_LBA				(0xFFFFu<<16)
#define	GPDMA_C10LBAR_LBA_0				(0x1u<<16)

// C10FCR Configuration

#define	GPDMA_C10FCR_TOF				(0x1u<<14)
#define	GPDMA_C10FCR_SUSPF				(0x1u<<13)
#define	GPDMA_C10FCR_USEF				(0x1u<<12)
#define	GPDMA_C10FCR_ULEF				(0x1u<<11)
#define	GPDMA_C10FCR_DTEF				(0x1u<<10)
#define	GPDMA_C10FCR_HTF				(0x1u<<9)
#define	GPDMA_C10FCR_TCF				(0x1u<<8)

#define	GPDMA_C10FCR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C10FCR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C10FCR_SUSPF_B_0X0		(0x0u<<13)
#define	GPDMA_C10FCR_SUSPF_B_0X1		(0x1u<<13)
#define	GPDMA_C10FCR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C10FCR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C10FCR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C10FCR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C10FCR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C10FCR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C10FCR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C10FCR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C10FCR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C10FCR_TCF_B_0X1			(0x1u<<8)

