hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpdma.h
#define	GPDMA_C12BR1_BRDDEC				(0x1u<<31)
#define	GPDMA_C12BR1_BRSDEC				(0x1u<<30)
#define	GPDMA_C12BR1_DDEC				(0x1u<<29)
#define	GPDMA_C12BR1_SDEC				(0x1u<<28)
#define	GPDMA_C12BR1_BRC				(0x7FFu<<16)
#define	GPDMA_C12BR1_BRC_0				(0x1u<<16)
#define	GPDMA_C12BR1_BNDT				(0xFFFFu<<0)
#define	GPDMA_C12BR1_BNDT_0				(0x1u<<0)

#define	GPDMA_C12BR1_BRDDEC_B_0X0		(0x0u<<31)
#define	GPDMA_C12BR1_BRDDEC_B_0X1		(0x1u<<31)
#define	GPDMA_C12BR1_BRSDEC_B_0X0		(0x0u<<30)
#define	GPDMA_C12BR1_BRSDEC_B_0X1		(0x1u<<30)
#define	GPDMA_C12BR1_DDEC_B_0X0			(0x0u<<29)
#define	GPDMA_C12BR1_DDEC_B_0X1			(0x1u<<29)
#define	GPDMA_C12BR1_SDEC_B_0X0			(0x0u<<28)
#define	GPDMA_C12BR1_SDEC_B_0X1			(0x1u<<28)

// C12SAR Configuration

#define	GPDMA_C12SAR_SA					(0xFFFFFFFFu<<0)
#define	GPDMA_C12SAR_SA_0				(0x1u<<0)

// C12DAR Configuration

#define	GPDMA_C12DAR_DA					(0xFFFFFFFFu<<0)
#define	GPDMA_C12DAR_DA_0				(0x1u<<0)

// C12TR3 Configuration

#define	GPDMA_C12TR3_DAO				(0x1FFFu<<16)
#define	GPDMA_C12TR3_DAO_0				(0x1u<<16)
#define	GPDMA_C12TR3_SAO				(0x1FFFu<<0)
#define	GPDMA_C12TR3_SAO_0				(0x1u<<0)

// C12BR2 Configuration

#define	GPDMA_C12BR2_BRDAO				(0xFFFFu<<16)
#define	GPDMA_C12BR2_BRDAO_0			(0x1u<<16)
#define	GPDMA_C12BR2_BRSAO				(0xFFFFu<<0)
#define	GPDMA_C12BR2_BRSAO_0			(0x1u<<0)

// C12LLR Configuration

#define	GPDMA_C12LLR_UT1				(0x1u<<31)
#define	GPDMA_C12LLR_UT2				(0x1u<<30)
#define	GPDMA_C12LLR_UB1				(0x1u<<29)
#define	GPDMA_C12LLR_USA				(0x1u<<28)
#define	GPDMA_C12LLR_UDA				(0x1u<<27)
#define	GPDMA_C12LLR_UT3				(0x1u<<26)
#define	GPDMA_C12LLR_UB2				(0x1u<<25)
#define	GPDMA_C12LLR_ULL				(0x1u<<16)
#define	GPDMA_C12LLR_LA					(0x3FFFu<<2)
#define	GPDMA_C12LLR_LA_0				(0x1u<<2)

#define	GPDMA_C12LLR_UT1_B_0X0			(0x0u<<31)
#define	GPDMA_C12LLR_UT1_B_0X1			(0x1u<<31)
#define	GPDMA_C12LLR_UT2_B_0X0			(0x0u<<30)
#define	GPDMA_C12LLR_UT2_B_0X1			(0x1u<<30)
#define	GPDMA_C12LLR_UB1_B_0X0			(0x0u<<29)
#define	GPDMA_C12LLR_UB1_B_0X1			(0x1u<<29)
#define	GPDMA_C12LLR_USA_B_0X0			(0x0u<<28)
#define	GPDMA_C12LLR_USA_B_0X1			(0x1u<<28)
#define	GPDMA_C12LLR_UDA_B_0X0			(0x0u<<27)
#define	GPDMA_C12LLR_UDA_B_0X1			(0x1u<<27)
#define	GPDMA_C12LLR_UT3_B_0X0			(0x0u<<26)
#define	GPDMA_C12LLR_UT3_B_0X1			(0x1u<<26)
#define	GPDMA_C12LLR_UB2_B_0X0			(0x0u<<25)
#define	GPDMA_C12LLR_UB2_B_0X1			(0x1u<<25)
#define	GPDMA_C12LLR_ULL_B_0X0			(0x0u<<16)
#define	GPDMA_C12LLR_ULL_B_0X1			(0x1u<<16)

// C13LBAR Configuration

#define	GPDMA_C13LBAR_LBA				(0xFFFFu<<16)
#define	GPDMA_C13LBAR_LBA_0				(0x1u<<16)

// C13FCR Configuration

#define	GPDMA_C13FCR_TOF				(0x1u<<14)
#define	GPDMA_C13FCR_SUSPF				(0x1u<<13)
#define	GPDMA_C13FCR_USEF				(0x1u<<12)
#define	GPDMA_C13FCR_ULEF				(0x1u<<11)
#define	GPDMA_C13FCR_DTEF				(0x1u<<10)
#define	GPDMA_C13FCR_HTF				(0x1u<<9)
#define	GPDMA_C13FCR_TCF				(0x1u<<8)

#define	GPDMA_C13FCR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C13FCR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C13FCR_SUSPF_B_0X0		(0x0u<<13)
#define	GPDMA_C13FCR_SUSPF_B_0X1		(0x1u<<13)
#define	GPDMA_C13FCR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C13FCR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C13FCR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C13FCR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C13FCR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C13FCR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C13FCR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C13FCR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C13FCR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C13FCR_TCF_B_0X1			(0x1u<<8)

// C13SR Configuration

#define	GPDMA_C13SR_FIFOL				(0xFFu<<16)
#define	GPDMA_C13SR_FIFOL_0				(0x1u<<16)
#define	GPDMA_C13SR_TOF					(0x1u<<14)
#define	GPDMA_C13SR_SUSPF				(0x1u<<13)
#define	GPDMA_C13SR_USEF				(0x1u<<12)
#define	GPDMA_C13SR_ULEF				(0x1u<<11)
#define	GPDMA_C13SR_DTEF				(0x1u<<10)
#define	GPDMA_C13SR_HTF					(0x1u<<9)
#define	GPDMA_C13SR_TCF					(0x1u<<8)
#define	GPDMA_C13SR_IDLEF				(0x1u<<0)

#define	GPDMA_C13SR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C13SR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C13SR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C13SR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C13SR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C13SR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C13SR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C13SR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C13SR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C13SR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C13SR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C13SR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C13SR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C13SR_TCF_B_0X1			(0x1u<<8)
#define	GPDMA_C13SR_IDLEF_B_0X0			(0x0u<<0)
#define	GPDMA_C13SR_IDLEF_B_0X1			(0x1u<<0)

// C13CR Configuration

#define	GPDMA_C13CR_PRIO				(0x3u<<22)
#define	GPDMA_C13CR_PRIO_0				(0x1u<<22)
#define	GPDMA_C13CR_LAP					(0x1u<<17)
#define	GPDMA_C13CR_LSM					(0x1u<<16)
#define	GPDMA_C13CR_TOIE				(0x1u<<14)
#define	GPDMA_C13CR_SUSPIE				(0x1u<<13)
#define	GPDMA_C13CR_USEIE				(0x1u<<12)
#define	GPDMA_C13CR_ULEIE				(0x1u<<11)
#define	GPDMA_C13CR_DTEIE				(0x1u<<10)
#define	GPDMA_C13CR_HTIE				(0x1u<<9)
#define	GPDMA_C13CR_TCIE				(0x1u<<8)
#define	GPDMA_C13CR_SUSP				(0x1u<<2)
#define	GPDMA_C13CR_RESET				(0x1u<<1)
#define	GPDMA_C13CR_EN					(0x1u<<0)

#define	GPDMA_C13CR_PRIO_B_0X0			(0x0u<<22)
#define	GPDMA_C13CR_PRIO_B_0X1			(0x1u<<22)
#define	GPDMA_C13CR_PRIO_B_0X2			(0x2u<<22)
#define	GPDMA_C13CR_PRIO_B_0X3			(0x3u<<22)
#define	GPDMA_C13CR_LAP_B_0X0			(0x0u<<17)
#define	GPDMA_C13CR_LAP_B_0X1			(0x1u<<17)
#define	GPDMA_C13CR_LSM_B_0X0			(0x0u<<16)
#define	GPDMA_C13CR_LSM_B_0X1			(0x1u<<16)
#define	GPDMA_C13CR_TOIE_B_0X0			(0x0u<<14)
#define	GPDMA_C13CR_TOIE_B_0X1			(0x1u<<14)
#define	GPDMA_C13CR_SUSPIE_B_0X0		(0x0u<<13)
#define	GPDMA_C13CR_SUSPIE_B_0X1		(0x1u<<13)
#define	GPDMA_C13CR_USEIE_B_0X0			(0x0u<<12)
#define	GPDMA_C13CR_USEIE_B_0X1			(0x1u<<12)
#define	GPDMA_C13CR_ULEIE_B_0X0			(0x0u<<11)
#define	GPDMA_C13CR_ULEIE_B_0X1			(0x1u<<11)
#define	GPDMA_C13CR_DTEIE_B_0X0			(0x0u<<10)
#define	GPDMA_C13CR_DTEIE_B_0X1			(0x1u<<10)
#define	GPDMA_C13CR_HTIE_B_0X0			(0x0u<<9)
#define	GPDMA_C13CR_HTIE_B_0X1			(0x1u<<9)
#define	GPDMA_C13CR_TCIE_B_0X0			(0x0u<<8)
#define	GPDMA_C13CR_TCIE_B_0X1			(0x1u<<8)
#define	GPDMA_C13CR_SUSP_B_0X0			(0x0u<<2)
#define	GPDMA_C13CR_SUSP_B_0X1			(0x1u<<2)
#define	GPDMA_C13CR_RESET_B_0X0			(0x0u<<1)
#define	GPDMA_C13CR_RESET_B_0X1			(0x1u<<1)
#define	GPDMA_C13CR_EN_B_0X0			(0x0u<<0)
#define	GPDMA_C13CR_EN_B_0X1			(0x1u<<0)

// C13TR1 Configuration

#define	GPDMA_C13TR1_DSEC				(0x1u<<31)
#define	GPDMA_C13TR1_DAP				(0x1u<<30)
#define	GPDMA_C13TR1_DHX				(0x1u<<27)
#define	GPDMA_C13TR1_DBX				(0x1u<<26)
#define	GPDMA_C13TR1_DBL_1				(0x3Fu<<20)
#define	GPDMA_C13TR1_DBL_1_0			(0x1u<<20)
#define	GPDMA_C13TR1_DINC				(0x1u<<19)
#define	GPDMA_C13TR1_DDW_LOG2			(0x3u<<16)
#define	GPDMA_C13TR1_DDW_LOG2_0			(0x1u<<16)
#define	GPDMA_C13TR1_SSEC				(0x1u<<15)
#define	GPDMA_C13TR1_SAP				(0x1u<<14)
#define	GPDMA_C13TR1_SBX				(0x1u<<13)
#define	GPDMA_C13TR1_PAM				(0x3u<<11)
#define	GPDMA_C13TR1_PAM_0				(0x1u<<11)
#define	GPDMA_C13TR1_SBL_1				(0x3Fu<<4)
#define	GPDMA_C13TR1_SBL_1_0			(0x1u<<4)
#define	GPDMA_C13TR1_SINC				(0x1u<<3)
#define	GPDMA_C13TR1_SDW_LOG2			(0x3u<<0)
#define	GPDMA_C13TR1_SDW_LOG2_0			(0x1u<<0)

