hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpdma.h
#define	GPDMA_C13TR1_DSEC_B_0X0			(0x0u<<31)
#define	GPDMA_C13TR1_DSEC_B_0X1			(0x1u<<31)
#define	GPDMA_C13TR1_DAP_B_0X0			(0x0u<<30)
#define	GPDMA_C13TR1_DAP_B_0X1			(0x1u<<30)
#define	GPDMA_C13TR1_DHX_B_0X0			(0x0u<<27)
#define	GPDMA_C13TR1_DHX_B_0X1			(0x1u<<27)
#define	GPDMA_C13TR1_DBX_B_0X0			(0x0u<<26)
#define	GPDMA_C13TR1_DBX_B_0X1			(0x1u<<26)
#define	GPDMA_C13TR1_DINC_B_0X0			(0x0u<<19)
#define	GPDMA_C13TR1_DINC_B_0X1			(0x1u<<19)
#define	GPDMA_C13TR1_DDW_LOG2_B_0X0		(0x0u<<16)
#define	GPDMA_C13TR1_DDW_LOG2_B_0X1		(0x1u<<16)
#define	GPDMA_C13TR1_DDW_LOG2_B_0X2		(0x2u<<16)
#define	GPDMA_C13TR1_DDW_LOG2_B_0X3		(0x3u<<16)
#define	GPDMA_C13TR1_SSEC_B_0X0			(0x0u<<15)
#define	GPDMA_C13TR1_SSEC_B_0X1			(0x1u<<15)
#define	GPDMA_C13TR1_SAP_B_0X0			(0x0u<<14)
#define	GPDMA_C13TR1_SAP_B_0X1			(0x1u<<14)
#define	GPDMA_C13TR1_SBX_B_0X0			(0x0u<<13)
#define	GPDMA_C13TR1_SBX_B_0X1			(0x1u<<13)
#define	GPDMA_C13TR1_PAM_B_0X0_PAM_1	(0x0u<<11)
#define	GPDMA_C13TR1_PAM_B_0X1_PAM_1	(0x1u<<11)
#define	GPDMA_C13TR1_PAM_B_0X2_PAM_1	(0x2u<<11)
#define	GPDMA_C13TR1_PAM_B_0X3_PAM_1	(0x3u<<11)
#define	GPDMA_C13TR1_SINC_B_0X0			(0x0u<<3)
#define	GPDMA_C13TR1_SINC_B_0X1			(0x1u<<3)
#define	GPDMA_C13TR1_SDW_LOG2_B_0X0		(0x0u<<0)
#define	GPDMA_C13TR1_SDW_LOG2_B_0X1		(0x1u<<0)
#define	GPDMA_C13TR1_SDW_LOG2_B_0X2		(0x2u<<0)
#define	GPDMA_C13TR1_SDW_LOG2_B_0X3		(0x3u<<0)

// C13TR2 Configuration

#define	GPDMA_C13TR2_TCEM				(0x3u<<30)
#define	GPDMA_C13TR2_TCEM_0				(0x1u<<30)
#define	GPDMA_C13TR2_TRIGPOL			(0x3u<<24)
#define	GPDMA_C13TR2_TRIGPOL_0			(0x1u<<24)
#define	GPDMA_C13TR2_TRIGSEL			(0x7Fu<<16)
#define	GPDMA_C13TR2_TRIGSEL_0			(0x1u<<16)
#define	GPDMA_C13TR2_TRIGM				(0x3u<<14)
#define	GPDMA_C13TR2_TRIGM_0			(0x1u<<14)
#define	GPDMA_C13TR2_PFREQ				(0x1u<<12)
#define	GPDMA_C13TR2_BREQ				(0x1u<<11)
#define	GPDMA_C13TR2_DREQ				(0x1u<<10)
#define	GPDMA_C13TR2_SWREQ				(0x1u<<9)
#define	GPDMA_C13TR2_REQSEL				(0xFFu<<0)
#define	GPDMA_C13TR2_REQSEL_0			(0x1u<<0)

#define	GPDMA_C13TR2_TCEM_B_0X0			(0x0u<<30)
#define	GPDMA_C13TR2_TCEM_B_0X1			(0x1u<<30)
#define	GPDMA_C13TR2_TCEM_B_0X2			(0x2u<<30)
#define	GPDMA_C13TR2_TCEM_B_0X3			(0x3u<<30)
#define	GPDMA_C13TR2_TRIGPOL_B_0X0		(0x0u<<24)
#define	GPDMA_C13TR2_TRIGPOL_B_0X1		(0x1u<<24)
#define	GPDMA_C13TR2_TRIGPOL_B_0X2		(0x2u<<24)
#define	GPDMA_C13TR2_TRIGPOL_B_0X3		(0x3u<<24)
#define	GPDMA_C13TR2_TRIGM_B_0X0		(0x0u<<14)
#define	GPDMA_C13TR2_TRIGM_B_0X1		(0x1u<<14)
#define	GPDMA_C13TR2_TRIGM_B_0X2		(0x2u<<14)
#define	GPDMA_C13TR2_TRIGM_B_0X3		(0x3u<<14)
#define	GPDMA_C13TR2_PFREQ_B_0X0		(0x0u<<12)
#define	GPDMA_C13TR2_PFREQ_B_0X1		(0x1u<<12)
#define	GPDMA_C13TR2_BREQ_B_0X0			(0x0u<<11)
#define	GPDMA_C13TR2_BREQ_B_0X1			(0x1u<<11)
#define	GPDMA_C13TR2_DREQ_B_0X0			(0x0u<<10)
#define	GPDMA_C13TR2_DREQ_B_0X1			(0x1u<<10)
#define	GPDMA_C13TR2_SWREQ_B_0X0		(0x0u<<9)
#define	GPDMA_C13TR2_SWREQ_B_0X1		(0x1u<<9)

// C13BR1 Configuration

#define	GPDMA_C13BR1_BRDDEC				(0x1u<<31)
#define	GPDMA_C13BR1_BRSDEC				(0x1u<<30)
#define	GPDMA_C13BR1_DDEC				(0x1u<<29)
#define	GPDMA_C13BR1_SDEC				(0x1u<<28)
#define	GPDMA_C13BR1_BRC				(0x7FFu<<16)
#define	GPDMA_C13BR1_BRC_0				(0x1u<<16)
#define	GPDMA_C13BR1_BNDT				(0xFFFFu<<0)
#define	GPDMA_C13BR1_BNDT_0				(0x1u<<0)

#define	GPDMA_C13BR1_BRDDEC_B_0X0		(0x0u<<31)
#define	GPDMA_C13BR1_BRDDEC_B_0X1		(0x1u<<31)
#define	GPDMA_C13BR1_BRSDEC_B_0X0		(0x0u<<30)
#define	GPDMA_C13BR1_BRSDEC_B_0X1		(0x1u<<30)
#define	GPDMA_C13BR1_DDEC_B_0X0			(0x0u<<29)
#define	GPDMA_C13BR1_DDEC_B_0X1			(0x1u<<29)
#define	GPDMA_C13BR1_SDEC_B_0X0			(0x0u<<28)
#define	GPDMA_C13BR1_SDEC_B_0X1			(0x1u<<28)

// C13SAR Configuration

#define	GPDMA_C13SAR_SA					(0xFFFFFFFFu<<0)
#define	GPDMA_C13SAR_SA_0				(0x1u<<0)

// C13DAR Configuration

#define	GPDMA_C13DAR_DA					(0xFFFFFFFFu<<0)
#define	GPDMA_C13DAR_DA_0				(0x1u<<0)

// C13TR3 Configuration

#define	GPDMA_C13TR3_DAO				(0x1FFFu<<16)
#define	GPDMA_C13TR3_DAO_0				(0x1u<<16)
#define	GPDMA_C13TR3_SAO				(0x1FFFu<<0)
#define	GPDMA_C13TR3_SAO_0				(0x1u<<0)

// C13BR2 Configuration

#define	GPDMA_C13BR2_BRDAO				(0xFFFFu<<16)
#define	GPDMA_C13BR2_BRDAO_0			(0x1u<<16)
#define	GPDMA_C13BR2_BRSAO				(0xFFFFu<<0)
#define	GPDMA_C13BR2_BRSAO_0			(0x1u<<0)

// C13LLR Configuration

#define	GPDMA_C13LLR_UT1				(0x1u<<31)
#define	GPDMA_C13LLR_UT2				(0x1u<<30)
#define	GPDMA_C13LLR_UB1				(0x1u<<29)
#define	GPDMA_C13LLR_USA				(0x1u<<28)
#define	GPDMA_C13LLR_UDA				(0x1u<<27)
#define	GPDMA_C13LLR_UT3				(0x1u<<26)
#define	GPDMA_C13LLR_UB2				(0x1u<<25)
#define	GPDMA_C13LLR_ULL				(0x1u<<16)
#define	GPDMA_C13LLR_LA					(0x3FFFu<<2)
#define	GPDMA_C13LLR_LA_0				(0x1u<<2)

#define	GPDMA_C13LLR_UT1_B_0X0			(0x0u<<31)
#define	GPDMA_C13LLR_UT1_B_0X1			(0x1u<<31)
#define	GPDMA_C13LLR_UT2_B_0X0			(0x0u<<30)
#define	GPDMA_C13LLR_UT2_B_0X1			(0x1u<<30)
#define	GPDMA_C13LLR_UB1_B_0X0			(0x0u<<29)
#define	GPDMA_C13LLR_UB1_B_0X1			(0x1u<<29)
#define	GPDMA_C13LLR_USA_B_0X0			(0x0u<<28)
#define	GPDMA_C13LLR_USA_B_0X1			(0x1u<<28)
#define	GPDMA_C13LLR_UDA_B_0X0			(0x0u<<27)
#define	GPDMA_C13LLR_UDA_B_0X1			(0x1u<<27)
#define	GPDMA_C13LLR_UT3_B_0X0			(0x0u<<26)
#define	GPDMA_C13LLR_UT3_B_0X1			(0x1u<<26)
#define	GPDMA_C13LLR_UB2_B_0X0			(0x0u<<25)
#define	GPDMA_C13LLR_UB2_B_0X1			(0x1u<<25)
#define	GPDMA_C13LLR_ULL_B_0X0			(0x0u<<16)
#define	GPDMA_C13LLR_ULL_B_0X1			(0x1u<<16)

// C14LBAR Configuration

#define	GPDMA_C14LBAR_LBA				(0xFFFFu<<16)
#define	GPDMA_C14LBAR_LBA_0				(0x1u<<16)

// C14FCR Configuration

#define	GPDMA_C14FCR_TOF				(0x1u<<14)
#define	GPDMA_C14FCR_SUSPF				(0x1u<<13)
#define	GPDMA_C14FCR_USEF				(0x1u<<12)
#define	GPDMA_C14FCR_ULEF				(0x1u<<11)
#define	GPDMA_C14FCR_DTEF				(0x1u<<10)
#define	GPDMA_C14FCR_HTF				(0x1u<<9)
#define	GPDMA_C14FCR_TCF				(0x1u<<8)

#define	GPDMA_C14FCR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C14FCR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C14FCR_SUSPF_B_0X0		(0x0u<<13)
#define	GPDMA_C14FCR_SUSPF_B_0X1		(0x1u<<13)
#define	GPDMA_C14FCR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C14FCR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C14FCR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C14FCR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C14FCR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C14FCR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C14FCR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C14FCR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C14FCR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C14FCR_TCF_B_0X1			(0x1u<<8)

// C14SR Configuration

#define	GPDMA_C14SR_FIFOL				(0xFFu<<16)
#define	GPDMA_C14SR_FIFOL_0				(0x1u<<16)
#define	GPDMA_C14SR_TOF					(0x1u<<14)
#define	GPDMA_C14SR_SUSPF				(0x1u<<13)
#define	GPDMA_C14SR_USEF				(0x1u<<12)
#define	GPDMA_C14SR_ULEF				(0x1u<<11)
#define	GPDMA_C14SR_DTEF				(0x1u<<10)
#define	GPDMA_C14SR_HTF					(0x1u<<9)
#define	GPDMA_C14SR_TCF					(0x1u<<8)
#define	GPDMA_C14SR_IDLEF				(0x1u<<0)

#define	GPDMA_C14SR_TOF_B_0X0			(0x0u<<14)
#define	GPDMA_C14SR_TOF_B_0X1			(0x1u<<14)
#define	GPDMA_C14SR_SUSPF_B_0X0			(0x0u<<13)
#define	GPDMA_C14SR_SUSPF_B_0X1			(0x1u<<13)
#define	GPDMA_C14SR_USEF_B_0X0			(0x0u<<12)
#define	GPDMA_C14SR_USEF_B_0X1			(0x1u<<12)
#define	GPDMA_C14SR_ULEF_B_0X0			(0x0u<<11)
#define	GPDMA_C14SR_ULEF_B_0X1			(0x1u<<11)
#define	GPDMA_C14SR_DTEF_B_0X0			(0x0u<<10)
#define	GPDMA_C14SR_DTEF_B_0X1			(0x1u<<10)
#define	GPDMA_C14SR_HTF_B_0X0			(0x0u<<9)
#define	GPDMA_C14SR_HTF_B_0X1			(0x1u<<9)
#define	GPDMA_C14SR_TCF_B_0X0			(0x0u<<8)
#define	GPDMA_C14SR_TCF_B_0X1			(0x1u<<8)
#define	GPDMA_C14SR_IDLEF_B_0X0			(0x0u<<0)
#define	GPDMA_C14SR_IDLEF_B_0X1			(0x1u<<0)

// C14CR Configuration

#define	GPDMA_C14CR_PRIO				(0x3u<<22)
#define	GPDMA_C14CR_PRIO_0				(0x1u<<22)
#define	GPDMA_C14CR_LAP					(0x1u<<17)
#define	GPDMA_C14CR_LSM					(0x1u<<16)
#define	GPDMA_C14CR_TOIE				(0x1u<<14)
#define	GPDMA_C14CR_SUSPIE				(0x1u<<13)
#define	GPDMA_C14CR_USEIE				(0x1u<<12)
#define	GPDMA_C14CR_ULEIE				(0x1u<<11)
#define	GPDMA_C14CR_DTEIE				(0x1u<<10)
#define	GPDMA_C14CR_HTIE				(0x1u<<9)
#define	GPDMA_C14CR_TCIE				(0x1u<<8)
#define	GPDMA_C14CR_SUSP				(0x1u<<2)
#define	GPDMA_C14CR_RESET				(0x1u<<1)
#define	GPDMA_C14CR_EN					(0x1u<<0)

