hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpdma.h
#define	GPDMA_C15BR1_BRDDEC				(0x1u<<31)
#define	GPDMA_C15BR1_BRSDEC				(0x1u<<30)
#define	GPDMA_C15BR1_DDEC				(0x1u<<29)
#define	GPDMA_C15BR1_SDEC				(0x1u<<28)
#define	GPDMA_C15BR1_BRC				(0x7FFu<<16)
#define	GPDMA_C15BR1_BRC_0				(0x1u<<16)
#define	GPDMA_C15BR1_BNDT				(0xFFFFu<<0)
#define	GPDMA_C15BR1_BNDT_0				(0x1u<<0)

#define	GPDMA_C15BR1_BRDDEC_B_0X0		(0x0u<<31)
#define	GPDMA_C15BR1_BRDDEC_B_0X1		(0x1u<<31)
#define	GPDMA_C15BR1_BRSDEC_B_0X0		(0x0u<<30)
#define	GPDMA_C15BR1_BRSDEC_B_0X1		(0x1u<<30)
#define	GPDMA_C15BR1_DDEC_B_0X0			(0x0u<<29)
#define	GPDMA_C15BR1_DDEC_B_0X1			(0x1u<<29)
#define	GPDMA_C15BR1_SDEC_B_0X0			(0x0u<<28)
#define	GPDMA_C15BR1_SDEC_B_0X1			(0x1u<<28)

// C15SAR Configuration

#define	GPDMA_C15SAR_SA					(0xFFFFFFFFu<<0)
#define	GPDMA_C15SAR_SA_0				(0x1u<<0)

// C15DAR Configuration

#define	GPDMA_C15DAR_DA					(0xFFFFFFFFu<<0)
#define	GPDMA_C15DAR_DA_0				(0x1u<<0)

// C15TR3 Configuration

#define	GPDMA_C15TR3_DAO				(0x1FFFu<<16)
#define	GPDMA_C15TR3_DAO_0				(0x1u<<16)
#define	GPDMA_C15TR3_SAO				(0x1FFFu<<0)
#define	GPDMA_C15TR3_SAO_0				(0x1u<<0)

// C15BR2 Configuration

#define	GPDMA_C15BR2_BRDAO				(0xFFFFu<<16)
#define	GPDMA_C15BR2_BRDAO_0			(0x1u<<16)
#define	GPDMA_C15BR2_BRSAO				(0xFFFFu<<0)
#define	GPDMA_C15BR2_BRSAO_0			(0x1u<<0)

// C15LLR Configuration

#define	GPDMA_C15LLR_UT1				(0x1u<<31)
#define	GPDMA_C15LLR_UT2				(0x1u<<30)
#define	GPDMA_C15LLR_UB1				(0x1u<<29)
#define	GPDMA_C15LLR_USA				(0x1u<<28)
#define	GPDMA_C15LLR_UDA				(0x1u<<27)
#define	GPDMA_C15LLR_UT3				(0x1u<<26)
#define	GPDMA_C15LLR_UB2				(0x1u<<25)
#define	GPDMA_C15LLR_ULL				(0x1u<<16)
#define	GPDMA_C15LLR_LA					(0x3FFFu<<2)
#define	GPDMA_C15LLR_LA_0				(0x1u<<2)

#define	GPDMA_C15LLR_UT1_B_0X0			(0x0u<<31)
#define	GPDMA_C15LLR_UT1_B_0X1			(0x1u<<31)
#define	GPDMA_C15LLR_UT2_B_0X0			(0x0u<<30)
#define	GPDMA_C15LLR_UT2_B_0X1			(0x1u<<30)
#define	GPDMA_C15LLR_UB1_B_0X0			(0x0u<<29)
#define	GPDMA_C15LLR_UB1_B_0X1			(0x1u<<29)
#define	GPDMA_C15LLR_USA_B_0X0			(0x0u<<28)
#define	GPDMA_C15LLR_USA_B_0X1			(0x1u<<28)
#define	GPDMA_C15LLR_UDA_B_0X0			(0x0u<<27)
#define	GPDMA_C15LLR_UDA_B_0X1			(0x1u<<27)
#define	GPDMA_C15LLR_UT3_B_0X0			(0x0u<<26)
#define	GPDMA_C15LLR_UT3_B_0X1			(0x1u<<26)
#define	GPDMA_C15LLR_UB2_B_0X0			(0x0u<<25)
#define	GPDMA_C15LLR_UB2_B_0X1			(0x1u<<25)
#define	GPDMA_C15LLR_ULL_B_0X0			(0x0u<<16)
#define	GPDMA_C15LLR_ULL_B_0X1			(0x1u<<16)
